[
    {
        "id":"blog_1",
        "title":"What is cors?",
        "content":"Cross-Origin Resource Sharing (CORS) is an HTTP-header based mechanism that allows a server to indicate any origins (domain, scheme, or port) other than its own from which a browser should permit loading resources. CORS also relies on a mechanism by which browsers make a \"preflight\" request to the server hosting the cross-origin resource, in order to check that the server will permit the actual request. In that preflight, the browser sends headers that indicate the HTTP method and headers that will be used in the actual request."
    },
    {
        "id":"blog_2",
        "title":"Why are you using firebase? What other options do you have to implement authentication?",
        "content":"The Firebase Realtime Database lets you build rich, collaborative applications by allowing secure access to the database directly from client-side code. Data is persisted locally, and even while offline, realtime events continue to fire, giving the end user a responsive experience. Yes! There are some alternatives: Back4App, Backendless, Kuzzle, Pubnub, Kumulos, Appwrite, Deployd, NHost, AWS Amplify, Heroku"
    },
    {
        "id":"blog_3",
        "title":"How does the private route work?",
        "content":"The private route component is similar to the public route, the only change is that redirect URL and authenticate condition.  If the user is not authenticated he will be redirected to the login page and the user can only access the authenticated routes If he is authenticated (Logged in)."
    },
    {
        "id":"blog_4",
        "title":"What is Node? How does Node work?",
        "content":"Node.js is an open source server environment. Node allows developers to write JavaScript code that runs directly in a computer process itself instead of in a browser. Node can, therefore, be used to write server-side applications with access to the operating system, file system, and everything else required to build fully-functional applications. Node Works as follows: 1. Node.js can generate dynamic page content, 2. Node.js can create, open, read, write, delete, and close files on the server, 3. Node.js can collect form data, 4.Node.js can add, delete, modify data in your database"
    }
]

